In [1]:
from MySQLdb import connect
import pandas as pd

/var/folders/fb/xl0hnskx527bfqkv38l3sn7h0000gn/T/ipykernel_2352/3687392072.py:2: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [2]:
# Connect to your MySQLdb
#conn = connect(host='localhost', user='root')
conn = connect(host='127.0.0.1', user='root', password = 'root', port = 8890)

In [3]:
# Open a cursor to perform database operations
cur = conn.cursor()

The SQL SELECT DISTINCT Statement
- The SELECT DISTINCT statement is used to return only distinct (different) values.

In [4]:
# Select all the different countries from the "Customers" table:
cur.execute('''SELECT DISTINCT Country FROM sqlw3s.Customers;''')
df = pd.DataFrame(tuple(t) for t in cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

        Country
0       Germany
1        Mexico
2            UK
3        Sweden
4        France
5         Spain
6        Canada
7     Argentina
8   Switzerland
9        Brazil
10      Austria
11        Italy
12     Portugal
13          USA
14    Venezuela
15      Ireland
16      Belgium
17       Norway
18      Denmark
19      Finland
20       Poland

Inside a table, a column often contains many duplicate values; and sometimes you only want to list the different (distinct) values.

>Syntax
>
>SELECT DISTINCT column1, column2, ...
>FROM table_name;

SELECT Example Without DISTINCT
- If you omit the DISTINCT keyword, the SQL statement returns the "Country" value from all the records of the "Customers" table:

In [5]:
# Example:
cur.execute('''SELECT Country FROM sqlw3s.Customers;''')
df = pd.DataFrame(tuple(t) for t in cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

    Country
0   Germany
1    Mexico
2    Mexico
3        UK
4    Sweden
..      ...
86  Finland
87   Brazil
88      USA
89  Finland
90   Poland

[91 rows x 1 columns]

Count Distinct
- By using the DISTINCT keyword in a function called COUNT, we can return the number of different countries.

In [6]:
# Example:
cur.execute('''SELECT COUNT(DISTINCT Country) FROM sqlw3s.Customers;''')
df = pd.DataFrame(tuple(t) for t in cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

   COUNT(DISTINCT Country)
0                       21

Note: The COUNT(DISTINCT column_name) is not supported in Microsoft Access databases.
- Here is a workaround for MS Access:

SELECT Count(*) AS DistinctCountries
FROM (SELECT DISTINCT Country FROM Customers);

You will learn about the COUNT function later in this tutorial.